In [0]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import LabelEncoder
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [0]:
df = pd.read_csv("/content/drive/My Drive/spoorthi/spoorthi.csv")

In [0]:
df.head(1)

           Timestamp     Name  ...  Unnamed: 6  Unnamed: 7
0  2/6/2020 21:39:00  Shivani  ...     Physics   Chemistry

[1 rows x 8 columns]

In [0]:
df.columns

Index(['Timestamp', 'Name', 'CGPA in tenth',
       'How old were you when you passed S.S.C?',
       'Three Subjects of interest (MATHEMATICS,PHYSICS,CHEMISTRY,BIOLOGY,HISTORY,ECONOMICS,CIVICS,COMMERCE)',
       'course opted after tenth (Eg. MPC/ BiPC/MEC etc.,)', 'Unnamed: 6',
       'Unnamed: 7'],
      dtype='object')

In [0]:
names = df['Name']
df.drop(['Timestamp','Name'],axis=1,inplace=True)

In [0]:
df.head()

   CGPA in tenth  ...  Unnamed: 7
0            9.8  ...   Chemistry
1           10.0  ...         NaN
2            9.8  ...   Chemistry
3           10.0  ...         NaN
4           10.0  ...   Economics

[5 rows x 6 columns]

In [0]:
d = {'cgpa':df['CGPA in tenth'],'age':df['How old were you when you passed S.S.C?'],
     's1':df['Three Subjects of interest (MATHEMATICS,PHYSICS,CHEMISTRY,BIOLOGY,HISTORY,ECONOMICS,CIVICS,COMMERCE)'],
     's2':df['Unnamed: 6'],'s3':df['Unnamed: 7'],
     'target' : df['course opted after tenth (Eg. MPC/ BiPC/MEC etc.,)']
     }

In [0]:
df = pd.DataFrame(d)

In [0]:
df.head()

   cgpa  age           s1           s2         s3 target
0   9.8   16  Mathematics      Physics  Chemistry    MPC
1  10.0   16  Mathematics          NaN        NaN    MPC
2   9.8   16        Maths      Physics  Chemistry    MPC
3  10.0   16        Maths      History        NaN    MPC
4  10.0   15      Physics  Mathematics  Economics    MPC

In [0]:
df1 = pd.DataFrame(df.loc[df['s1']=='Maths',:])

In [0]:
df1

    cgpa   age     s1         s2          s3 target
2    9.8    16  Maths    Physics   Chemistry    MPC
3   10.0    16  Maths    History         NaN    MPC
43   8.8    16  Maths  Chemistry     Biology    Mpc
61   9.7    14  Maths  Chemistry     Physics    MPC
62   9.2    16  Maths    Physics  Chemistry     Mpc
71   8.0  2015  Maths   Biology     History     Mpc
73   9.7    15  Maths  Chemistry     History    MPC
84   9.5    15  Maths   Physics   Chemistry    Mpc
85   9.5    15  Maths   Physics   Chemistry    Mpc

In [0]:
le = LabelEncoder()
df1['s1'] = le.fit_transform(df1['s1'])

In [0]:
df1['s1']

2     0
3     0
43    0
61    0
62    0
71    0
73    0
84    0
85    0
Name: s1, dtype: int64

In [0]:
le2 = LabelEncoder()
df1['s2'] = le2.fit_transform(df1['s2'])

In [0]:
df1['s2'].unique()

array([3, 2, 1, 0, 4])

In [0]:
le3 = LabelEncoder()
df1['s3'].unique()

array(['Chemistry', nan, 'Biology', 'Physics', 'Chemistry ', 'History ',
       'History'], dtype=object)

In [0]:
df1['s3'] = df1['s3'].fillna('')

In [0]:
df1['s3'] = le3.fit_transform(df1['s3'])

In [0]:
df1.head()

    cgpa  age  s1  s2  s3 target
2    9.8   16   0   3   2    MPC
3   10.0   16   0   2   0    MPC
43   8.8   16   0   1   1    Mpc
61   9.7   14   0   1   6    MPC
62   9.2   16   0   3   3    Mpc

In [0]:
le4 = LabelEncoder()
df1['target'] = le4.fit_transform(df1['target'].apply(lambda x:x.lower()))

In [0]:
df1['target'].unique()

array([0, 1])

In [0]:
df1.head()

    cgpa  age  s1  s2  s3  target
2    9.8   16   0   3   2       0
3   10.0   16   0   2   0       0
43   8.8   16   0   1   1       0
61   9.7   14   0   1   6       0
62   9.2   16   0   3   3       0

In [0]:
t1 = df1['target']

In [0]:
df1.drop(['target'],axis=1,inplace=True)

In [0]:
df1.head()

    cgpa  age  s1  s2  s3
2    9.8   16   0   3   2
3   10.0   16   0   2   0
43   8.8   16   0   1   1
61   9.7   14   0   1   6
62   9.2   16   0   3   3

In [0]:
xtrain,xvalid,ytrain,yvalid = train_test_split(df1,t1,test_size=0.2)

In [0]:
lr = LogisticRegression()
model1 = lr.fit(xtrain,ytrain)
prediction1 = lr.predict(xvalid)
print(accuracy_score(yvalid,prediction1))

1.0

In [0]:
df['s1'].unique()

array(['Mathematics', 'Maths', 'Physics', 'MATHEMATICS ', 'Economics',
       'History', 'Biology', 'Commerce', 'Chemistry', 'Mathematics ',
       'mathematics', 'biology ', 'Chemistry ', 'maths', 'Economic ',
       'MATHEMATICS', 'Civics ', 'Mathematics,physics, chemistry',
       'History ', 'Maths physics chemistry', 'biology'], dtype=object)

In [0]:
df['s1'].describe()

count              86
unique             21
top       Mathematics
freq               28
Name: s1, dtype: object